{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hey there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "about",
      "patterns": [
        "What is Devcomm?",
        "Tell me about Devcomm",
        "What is Devcomm about?",
        "What happens in Devcomm?",
        "Why should I join Devcomm?"
      ],
      "responses": [
        "Devcomm is the best tech-society at NSUT. Devcomm provides community for the developers to upskill themselves by developing projects with real life applications and interact with other fellow developers."
      ]
    },
    {
      "tag": "register",
      "patterns": [
        "How can I register?",
        "How can I be a part of Devcomm?",
        "How to be a part of Devcomm?",
        "How to join Devcomm?",
        "What is the joining process?"
      ],
      "responses": [
        "Registration is done once every year. For more details visit the registration tab on the website.",
        "Recruitment begins at the starting of the year. For more details visit the registration tab on the website."
      ]
    },
    {
      "tag": "eligibility",
      "patterns": [
        "What is the eligibility criteria to join Devcomm?",
        "Eligibility criteria to join Devcomm"
      ],
      "responses": [
        "The only eligibility criteria is to have enough interesta and enthusiasm :-) ",
        "Anyone with interest in tech field can be a part of Devcomm :-)"
      ]
    },
    {
      "tag": "comparison",
      "patterns": [
        "How is Devcomm better than other tech societies at NSUT?",
        "Compare Devcomm with other tech societies",
        "Why should I join Devcomm and not any other tech society?"
      ],
      "responses": [
        "Devcomm provides you with oppurtunities to be a part of projects with immediate real-life appliactions thereby providing you with adequate exposure to industrial way of working and developing. Devcomm is more active than other tech societies at NSUT and all the major applications like NSUTx and Nescii have been developed by Devcomm."
      ]
    },
    {
      "tag": "projects",
      "patterns": [
        "Tell me about projects developed by Devcomm",
        "What are the major projects developed by Devcomm?",
        "Tell me about flagship projects of Devcomm"
      ],
      "responses": [
        "NSUTx and Nescii are the two flagship projects developed by Devcomm. Apart from this other applications like Resource-hub,TNP Portal, Devcomm's official website to name a few have also been developed by developers at Devcomm."
      ]
    },
    {
      "tag": "events",
      "patterns": [
        "What events are organised by Devcomm?",
        "Tell me about events organised by Devcomm",
        "Which events are organised by Devcomm?"
      ],
      "responses": [
        "Devcomm organises events round the year to keep the students engaged and provide them with a chance to enhance their technical skills. Techx is Devcomm's flagship annual event with several fun competitions. Apart from this frequent coding competitions and kaggle competitions are also organised."
      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Tell me something funny!",
        "Do you know a joke?"
      ],
      "responses": [
        "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
        "What did the buffalo say when his son left for college? Bison."
      ]
    }
  ]
}
